GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k42.h
// Register: DMA2CON0
#define DMA2CON0 DMA2CON0
extern volatile unsigned char           DMA2CON0            __at(0x3BDC);
#ifndef _LIB_BUILD
asm("DMA2CON0 equ 03BDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DMA2XIP                :1;
        unsigned                        :1;
        unsigned DMA2AIRQEN             :1;
        unsigned                        :2;
        unsigned DMA2DGO                :1;
        unsigned DMA2SIRQEN             :1;
        unsigned DMA2EN                 :1;
    };
} DMA2CON0bits_t;
extern volatile DMA2CON0bits_t DMA2CON0bits __at(0x3BDC);
// bitfield macros
#define _DMA2CON0_XIP_POSN                                  0x0
#define _DMA2CON0_XIP_POSITION                              0x0
#define _DMA2CON0_XIP_SIZE                                  0x1
#define _DMA2CON0_XIP_LENGTH                                0x1
#define _DMA2CON0_XIP_MASK                                  0x1
#define _DMA2CON0_AIRQEN_POSN                               0x2
#define _DMA2CON0_AIRQEN_POSITION                           0x2
#define _DMA2CON0_AIRQEN_SIZE                               0x1
#define _DMA2CON0_AIRQEN_LENGTH                             0x1
#define _DMA2CON0_AIRQEN_MASK                               0x4
#define _DMA2CON0_DGO_POSN                                  0x5
#define _DMA2CON0_DGO_POSITION                              0x5
#define _DMA2CON0_DGO_SIZE                                  0x1
#define _DMA2CON0_DGO_LENGTH                                0x1
#define _DMA2CON0_DGO_MASK                                  0x20
#define _DMA2CON0_SIRQEN_POSN                               0x6
#define _DMA2CON0_SIRQEN_POSITION                           0x6
#define _DMA2CON0_SIRQEN_SIZE                               0x1
#define _DMA2CON0_SIRQEN_LENGTH                             0x1
#define _DMA2CON0_SIRQEN_MASK                               0x40
#define _DMA2CON0_EN_POSN                                   0x7
#define _DMA2CON0_EN_POSITION                               0x7
#define _DMA2CON0_EN_SIZE                                   0x1
#define _DMA2CON0_EN_LENGTH                                 0x1
#define _DMA2CON0_EN_MASK                                   0x80
#define _DMA2CON0_DMA2XIP_POSN                              0x0
#define _DMA2CON0_DMA2XIP_POSITION                          0x0
#define _DMA2CON0_DMA2XIP_SIZE                              0x1
#define _DMA2CON0_DMA2XIP_LENGTH                            0x1
#define _DMA2CON0_DMA2XIP_MASK                              0x1
#define _DMA2CON0_DMA2AIRQEN_POSN                           0x2
#define _DMA2CON0_DMA2AIRQEN_POSITION                       0x2
#define _DMA2CON0_DMA2AIRQEN_SIZE                           0x1
#define _DMA2CON0_DMA2AIRQEN_LENGTH                         0x1
#define _DMA2CON0_DMA2AIRQEN_MASK                           0x4
#define _DMA2CON0_DMA2DGO_POSN                              0x5
#define _DMA2CON0_DMA2DGO_POSITION                          0x5
#define _DMA2CON0_DMA2DGO_SIZE                              0x1
#define _DMA2CON0_DMA2DGO_LENGTH                            0x1
#define _DMA2CON0_DMA2DGO_MASK                              0x20
#define _DMA2CON0_DMA2SIRQEN_POSN                           0x6
#define _DMA2CON0_DMA2SIRQEN_POSITION                       0x6
#define _DMA2CON0_DMA2SIRQEN_SIZE                           0x1
#define _DMA2CON0_DMA2SIRQEN_LENGTH                         0x1
#define _DMA2CON0_DMA2SIRQEN_MASK                           0x40
#define _DMA2CON0_DMA2EN_POSN                               0x7
#define _DMA2CON0_DMA2EN_POSITION                           0x7
#define _DMA2CON0_DMA2EN_SIZE                               0x1
#define _DMA2CON0_DMA2EN_LENGTH                             0x1
#define _DMA2CON0_DMA2EN_MASK                               0x80

// Register: DMA2CON1
#define DMA2CON1 DMA2CON1
extern volatile unsigned char           DMA2CON1            __at(0x3BDD);
#ifndef _LIB_BUILD
asm("DMA2CON1 equ 03BDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMA2CON1bits_t;
extern volatile DMA2CON1bits_t DMA2CON1bits __at(0x3BDD);
// bitfield macros
#define _DMA2CON1_SSTP_POSN                                 0x0
#define _DMA2CON1_SSTP_POSITION                             0x0
#define _DMA2CON1_SSTP_SIZE                                 0x1
#define _DMA2CON1_SSTP_LENGTH                               0x1
#define _DMA2CON1_SSTP_MASK                                 0x1
#define _DMA2CON1_SMODE_POSN                                0x1
#define _DMA2CON1_SMODE_POSITION                            0x1
#define _DMA2CON1_SMODE_SIZE                                0x2
#define _DMA2CON1_SMODE_LENGTH                              0x2
#define _DMA2CON1_SMODE_MASK                                0x6
#define _DMA2CON1_SMR_POSN                                  0x3
#define _DMA2CON1_SMR_POSITION                              0x3
#define _DMA2CON1_SMR_SIZE                                  0x2
#define _DMA2CON1_SMR_LENGTH                                0x2
#define _DMA2CON1_SMR_MASK                                  0x18
#define _DMA2CON1_DSTP_POSN                                 0x5
#define _DMA2CON1_DSTP_POSITION                             0x5
#define _DMA2CON1_DSTP_SIZE                                 0x1
#define _DMA2CON1_DSTP_LENGTH                               0x1
#define _DMA2CON1_DSTP_MASK                                 0x20
#define _DMA2CON1_DMODE_POSN                                0x6
#define _DMA2CON1_DMODE_POSITION                            0x6
#define _DMA2CON1_DMODE_SIZE                                0x2
#define _DMA2CON1_DMODE_LENGTH                              0x2
#define _DMA2CON1_DMODE_MASK                                0xC0

// Register: DMA2AIRQ
#define DMA2AIRQ DMA2AIRQ
extern volatile unsigned char           DMA2AIRQ            __at(0x3BDE);
#ifndef _LIB_BUILD
asm("DMA2AIRQ equ 03BDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned DMA2AIRQ               :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
    };
    struct {
        unsigned DMA2AIRQ0              :1;
        unsigned DMA2AIRQ1              :1;
        unsigned DMA2AIRQ2              :1;
        unsigned DMA2AIRQ3              :1;
        unsigned DMA2AIRQ4              :1;
        unsigned DMA2AIRQ5              :1;
        unsigned DMA2AIRQ6              :1;
    };
} DMA2AIRQbits_t;
extern volatile DMA2AIRQbits_t DMA2AIRQbits __at(0x3BDE);
// bitfield macros
#define _DMA2AIRQ_AIRQ_POSN                                 0x0
#define _DMA2AIRQ_AIRQ_POSITION                             0x0
#define _DMA2AIRQ_AIRQ_SIZE                                 0x8
#define _DMA2AIRQ_AIRQ_LENGTH                               0x8
#define _DMA2AIRQ_AIRQ_MASK                                 0xFF
#define _DMA2AIRQ_DMA2AIRQ_POSN                             0x0
#define _DMA2AIRQ_DMA2AIRQ_POSITION                         0x0
#define _DMA2AIRQ_DMA2AIRQ_SIZE                             0x8
#define _DMA2AIRQ_DMA2AIRQ_LENGTH                           0x8
#define _DMA2AIRQ_DMA2AIRQ_MASK                             0xFF
#define _DMA2AIRQ_AIRQ0_POSN                                0x0
#define _DMA2AIRQ_AIRQ0_POSITION                            0x0
#define _DMA2AIRQ_AIRQ0_SIZE                                0x1
#define _DMA2AIRQ_AIRQ0_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ0_MASK                                0x1
#define _DMA2AIRQ_AIRQ1_POSN                                0x1
#define _DMA2AIRQ_AIRQ1_POSITION                            0x1
#define _DMA2AIRQ_AIRQ1_SIZE                                0x1
#define _DMA2AIRQ_AIRQ1_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ1_MASK                                0x2
#define _DMA2AIRQ_AIRQ2_POSN                                0x2
#define _DMA2AIRQ_AIRQ2_POSITION                            0x2
#define _DMA2AIRQ_AIRQ2_SIZE                                0x1
#define _DMA2AIRQ_AIRQ2_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ2_MASK                                0x4
#define _DMA2AIRQ_AIRQ3_POSN                                0x3
#define _DMA2AIRQ_AIRQ3_POSITION                            0x3
#define _DMA2AIRQ_AIRQ3_SIZE                                0x1
#define _DMA2AIRQ_AIRQ3_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ3_MASK                                0x8
#define _DMA2AIRQ_AIRQ4_POSN                                0x4
#define _DMA2AIRQ_AIRQ4_POSITION                            0x4
#define _DMA2AIRQ_AIRQ4_SIZE                                0x1
#define _DMA2AIRQ_AIRQ4_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ4_MASK                                0x10
#define _DMA2AIRQ_AIRQ5_POSN                                0x5
#define _DMA2AIRQ_AIRQ5_POSITION                            0x5
#define _DMA2AIRQ_AIRQ5_SIZE                                0x1
#define _DMA2AIRQ_AIRQ5_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ5_MASK                                0x20
#define _DMA2AIRQ_AIRQ6_POSN                                0x6
#define _DMA2AIRQ_AIRQ6_POSITION                            0x6
#define _DMA2AIRQ_AIRQ6_SIZE                                0x1
#define _DMA2AIRQ_AIRQ6_LENGTH                              0x1
#define _DMA2AIRQ_AIRQ6_MASK                                0x40
#define _DMA2AIRQ_DMA2AIRQ0_POSN                            0x0
#define _DMA2AIRQ_DMA2AIRQ0_POSITION                        0x0
#define _DMA2AIRQ_DMA2AIRQ0_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ0_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ0_MASK                            0x1
#define _DMA2AIRQ_DMA2AIRQ1_POSN                            0x1
#define _DMA2AIRQ_DMA2AIRQ1_POSITION                        0x1
#define _DMA2AIRQ_DMA2AIRQ1_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ1_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ1_MASK                            0x2
#define _DMA2AIRQ_DMA2AIRQ2_POSN                            0x2
#define _DMA2AIRQ_DMA2AIRQ2_POSITION                        0x2
#define _DMA2AIRQ_DMA2AIRQ2_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ2_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ2_MASK                            0x4
#define _DMA2AIRQ_DMA2AIRQ3_POSN                            0x3
#define _DMA2AIRQ_DMA2AIRQ3_POSITION                        0x3
#define _DMA2AIRQ_DMA2AIRQ3_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ3_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ3_MASK                            0x8
#define _DMA2AIRQ_DMA2AIRQ4_POSN                            0x4
#define _DMA2AIRQ_DMA2AIRQ4_POSITION                        0x4
#define _DMA2AIRQ_DMA2AIRQ4_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ4_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ4_MASK                            0x10
#define _DMA2AIRQ_DMA2AIRQ5_POSN                            0x5
#define _DMA2AIRQ_DMA2AIRQ5_POSITION                        0x5
#define _DMA2AIRQ_DMA2AIRQ5_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ5_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ5_MASK                            0x20
#define _DMA2AIRQ_DMA2AIRQ6_POSN                            0x6
#define _DMA2AIRQ_DMA2AIRQ6_POSITION                        0x6
#define _DMA2AIRQ_DMA2AIRQ6_SIZE                            0x1
#define _DMA2AIRQ_DMA2AIRQ6_LENGTH                          0x1
#define _DMA2AIRQ_DMA2AIRQ6_MASK                            0x40

// Register: DMA2SIRQ
#define DMA2SIRQ DMA2SIRQ
extern volatile unsigned char           DMA2SIRQ            __at(0x3BDF);
#ifndef _LIB_BUILD
asm("DMA2SIRQ equ 03BDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned DMA2SIRQ               :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
    };
    struct {
        unsigned DMA2SIRQ0              :1;
        unsigned DMA2SIRQ1              :1;
        unsigned DMA2SIRQ2              :1;
        unsigned DMA2SIRQ3              :1;
        unsigned DMA2SIRQ4              :1;
        unsigned DMA2SIRQ5              :1;
        unsigned DMA2SIRQ6              :1;
    };
} DMA2SIRQbits_t;
extern volatile DMA2SIRQbits_t DMA2SIRQbits __at(0x3BDF);
// bitfield macros
#define _DMA2SIRQ_SIRQ_POSN                                 0x0
#define _DMA2SIRQ_SIRQ_POSITION                             0x0
#define _DMA2SIRQ_SIRQ_SIZE                                 0x8
#define _DMA2SIRQ_SIRQ_LENGTH                               0x8
#define _DMA2SIRQ_SIRQ_MASK                                 0xFF
#define _DMA2SIRQ_DMA2SIRQ_POSN                             0x0
#define _DMA2SIRQ_DMA2SIRQ_POSITION                         0x0
#define _DMA2SIRQ_DMA2SIRQ_SIZE                             0x8
#define _DMA2SIRQ_DMA2SIRQ_LENGTH                           0x8
#define _DMA2SIRQ_DMA2SIRQ_MASK                             0xFF
#define _DMA2SIRQ_SIRQ0_POSN                                0x0
#define _DMA2SIRQ_SIRQ0_POSITION                            0x0
#define _DMA2SIRQ_SIRQ0_SIZE                                0x1
#define _DMA2SIRQ_SIRQ0_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ0_MASK                                0x1
#define _DMA2SIRQ_SIRQ1_POSN                                0x1
#define _DMA2SIRQ_SIRQ1_POSITION                            0x1
#define _DMA2SIRQ_SIRQ1_SIZE                                0x1
#define _DMA2SIRQ_SIRQ1_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ1_MASK                                0x2
#define _DMA2SIRQ_SIRQ2_POSN                                0x2
#define _DMA2SIRQ_SIRQ2_POSITION                            0x2
#define _DMA2SIRQ_SIRQ2_SIZE                                0x1
#define _DMA2SIRQ_SIRQ2_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ2_MASK                                0x4
#define _DMA2SIRQ_SIRQ3_POSN                                0x3
#define _DMA2SIRQ_SIRQ3_POSITION                            0x3
#define _DMA2SIRQ_SIRQ3_SIZE                                0x1
#define _DMA2SIRQ_SIRQ3_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ3_MASK                                0x8
#define _DMA2SIRQ_SIRQ4_POSN                                0x4
#define _DMA2SIRQ_SIRQ4_POSITION                            0x4
#define _DMA2SIRQ_SIRQ4_SIZE                                0x1
#define _DMA2SIRQ_SIRQ4_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ4_MASK                                0x10
#define _DMA2SIRQ_SIRQ5_POSN                                0x5
#define _DMA2SIRQ_SIRQ5_POSITION                            0x5
#define _DMA2SIRQ_SIRQ5_SIZE                                0x1
#define _DMA2SIRQ_SIRQ5_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ5_MASK                                0x20
#define _DMA2SIRQ_SIRQ6_POSN                                0x6
#define _DMA2SIRQ_SIRQ6_POSITION                            0x6
#define _DMA2SIRQ_SIRQ6_SIZE                                0x1
#define _DMA2SIRQ_SIRQ6_LENGTH                              0x1
#define _DMA2SIRQ_SIRQ6_MASK                                0x40
#define _DMA2SIRQ_DMA2SIRQ0_POSN                            0x0
#define _DMA2SIRQ_DMA2SIRQ0_POSITION                        0x0
#define _DMA2SIRQ_DMA2SIRQ0_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ0_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ0_MASK                            0x1
#define _DMA2SIRQ_DMA2SIRQ1_POSN                            0x1
#define _DMA2SIRQ_DMA2SIRQ1_POSITION                        0x1
#define _DMA2SIRQ_DMA2SIRQ1_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ1_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ1_MASK                            0x2
#define _DMA2SIRQ_DMA2SIRQ2_POSN                            0x2
#define _DMA2SIRQ_DMA2SIRQ2_POSITION                        0x2
#define _DMA2SIRQ_DMA2SIRQ2_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ2_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ2_MASK                            0x4
#define _DMA2SIRQ_DMA2SIRQ3_POSN                            0x3
#define _DMA2SIRQ_DMA2SIRQ3_POSITION                        0x3
#define _DMA2SIRQ_DMA2SIRQ3_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ3_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ3_MASK                            0x8
#define _DMA2SIRQ_DMA2SIRQ4_POSN                            0x4
#define _DMA2SIRQ_DMA2SIRQ4_POSITION                        0x4
#define _DMA2SIRQ_DMA2SIRQ4_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ4_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ4_MASK                            0x10
#define _DMA2SIRQ_DMA2SIRQ5_POSN                            0x5
#define _DMA2SIRQ_DMA2SIRQ5_POSITION                        0x5
#define _DMA2SIRQ_DMA2SIRQ5_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ5_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ5_MASK                            0x20
#define _DMA2SIRQ_DMA2SIRQ6_POSN                            0x6
#define _DMA2SIRQ_DMA2SIRQ6_POSITION                        0x6
#define _DMA2SIRQ_DMA2SIRQ6_SIZE                            0x1
#define _DMA2SIRQ_DMA2SIRQ6_LENGTH                          0x1
#define _DMA2SIRQ_DMA2SIRQ6_MASK                            0x40

// Register: DMA1BUF
#define DMA1BUF DMA1BUF
extern volatile unsigned char           DMA1BUF             __at(0x3BE9);
#ifndef _LIB_BUILD
asm("DMA1BUF equ 03BE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
    struct {
        unsigned DMA1BUF                :8;
    };
    struct {
        unsigned DMA1BUF0               :1;
        unsigned DMA1BUF1               :1;
        unsigned DMA1BUF2               :1;
        unsigned DMA1BUF3               :1;
        unsigned DMA1BUF4               :1;
        unsigned DMA1BUF5               :1;
        unsigned DMA1BUF6               :1;
        unsigned DMA1BUF7               :1;
    };
} DMA1BUFbits_t;
